9/data/attachments/2ddd47c94f8c1ef9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_9a7ccd03-c2bd-49fd-8296-74a569e46d08</nif:username>
            <nif:friendToBeAdded>James_camera_Friend_24685_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>